2014/Sep.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Sep</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Sep"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-18T17:04+0400"/>
<meta name="author" content="Abraham Xiao"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Sep</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 September, 2014 (Maybe the last month @Masdar Institute)</a>
<ul>
<li><a href="#sec-1-1">1.1 20140906</a></li>
<li><a href="#sec-1-2">1.2 20140907</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Lab, 16:30 [100%]</a></li>
<li><a href="#sec-1-2-2">1.2.2 Lab, 23:00</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 20140908</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Office, 15:00</a></li>
<li><a href="#sec-1-3-2">1.3.2 Lab, 00:30</a></li>
<li><a href="#sec-1-3-3">1.3.3 Lab, 17:15</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 20140909</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 Lab, 02:00</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 20140910</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 Lab, 00:00</a></li>
<li><a href="#sec-1-5-2">1.5.2 Lab, 03:00</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 20140916</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 Lab, 00:35</a></li>
<li><a href="#sec-1-6-2">1.6.2 Lab, 18:40</a></li>
<li><a href="#sec-1-6-3">1.6.3 Lab, 19:00</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 20140918</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1 Lab, 15:50</a></li>
<li><a href="#sec-1-7-2">1.7.2 CR9, 17:00</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> September, 2014 (Maybe the last month @Masdar Institute)</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 20140906</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>To be or not to be, it's a question.
</li>
</ul>



</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 20140907</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> Lab, 16:30 [100%]</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-09-07 Sun 17:00</span></span><br/>
</p><ul>
<li><code>[X]</code> Make a phone call to mom.
</li>
<li><code>[&nbsp;]</code> Read the book about embedded systems, 4 pomodoros.
</li>
<li>Read those materials again about Java, Programming and IDE.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Lab, 23:00</h4>
<div class="outline-text-4" id="text-1-2-2">

<ul>
<li><code>[&nbsp;]</code> Listen to some chapters of audio books
</li>
<li><code>[&nbsp;]</code> Finish reading of some chapters of Embedded System
      development.
</li>
<li><code>[&nbsp;]</code> Watch the video tutorial of python. And LEARN BY DOING.
</li>
</ul>




</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 20140908</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Office, 15:00</h4>
<div class="outline-text-4" id="text-1-3-1">

<ul>
<li>talk with the academic people.
</li>
<li>maybe a talk with department head.
</li>
<li>back to your desk and do what is required.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Lab, 00:30</h4>
<div class="outline-text-4" id="text-1-3-2">

<ul>
<li><code>[&nbsp;]</code> Write an email to Mrs. Nooreya, who is the student counselor
      and to whom you should have done some IMPORTANT talkings much
      earlier.
<ul>
<li>Requirements, Actions and Punishments.
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Lab, 17:15</h4>
<div class="outline-text-4" id="text-1-3-3">

<ul>
<li>Be a good student. Try your best to graduate and do something
      meaningful as a researcher &amp; hacker.
</li>
</ul>




</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 20140909</h3>
<div class="outline-text-3" id="text-1-4">



</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Lab, 02:00</h4>
<div class="outline-text-4" id="text-1-4-1">

<ul>
<li>Read and critical review of publications of the 2 selected
      professors at New York University Abu Dhabi.
</li>
<li>"You are still willing to work hard as a researcher in the
      academia right?""Then just do it, buddy."
</li>
<li><code>[&nbsp;]</code> Talk with some professors here at Masdar.
</li>
<li><code>[&nbsp;]</code> Finish the video courses about Python, and feel how to be a
      real Engineer as well as Researcher! DO NOT FUCK IT UP.
</li>
<li>
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 20140910</h3>
<div class="outline-text-3" id="text-1-5">


</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Lab, 00:00</h4>
<div class="outline-text-4" id="text-1-5-1">

<ul>
<li><code>[&nbsp;]</code> Listening while eating, walking and thinking, "A Random Walk
      down Wall Street"
</li>
<li>PyCharm, Python tutorials with real practice. Update those
      codes to Github if possible.
</li>
<li>Work till no later than 1:30 am; go to bed and get up
      early. Breakfast matters a lot for a man's healthy growth, to
      be honest.
</li>
</ul>



</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> Lab, 03:00</h4>
<div class="outline-text-4" id="text-1-5-2">

<ul>
<li><code>[&nbsp;]</code> Talk with Chen Zhang.
</li>
<li><code>[&nbsp;]</code> Talk with Dr. Hatem and Dr. Afshin (well, if possible)
</li>
<li><code>[&nbsp;]</code> Be a good man and be ready to work. Fluent in English, high
      in SELF-MOTIVATION.
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 20140916</h3>
<div class="outline-text-3" id="text-1-6">



</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> Lab, 00:35</h4>
<div class="outline-text-4" id="text-1-6-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-09-16 Tue</span></span><br/>
</p><ul>
<li><code>[&nbsp;]</code> Finish reading again the guidelines or, documentation of
      Octopress.
</li>
<li>Well, one Chinese mate does not understand the IMPORTANCE of
      proper preparations. However, I have wasted the time and those
      opportunities by myself, which is, well, the prime target to
      blame.
</li>
<li>Be a good student, my friend. Masdar treats you soooo well, and
      you were acting like a bitch.
</li>
</ul>



</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> Lab, 18:40</h4>
<div class="outline-text-4" id="text-1-6-2">

<ul>
<li>Mistakes were made, but the last chance should or should not be
      given. I do not know. Ask those professors.
</li>
<li>Yeah this is a research institute, and you should do research
      instead of having fun.
</li>
<li><code>[&nbsp;]</code> Write an email to Mrs. Nooreya.
</li>
<li>Write an email to Dr. Afshin, saying that this is a free
      resource and I have no option but to work hard.
</li>
<li>Make the meeting appointment with Dr. Hatem 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> Lab, 19:00</h4>
<div class="outline-text-4" id="text-1-6-3">

<ul>
<li><code>[&nbsp;]</code> Octopress, documentation.
</li>
<li><code>[&nbsp;]</code> Pro Git, documentation.
</li>
<li><code>[&nbsp;]</code> There are some people for you to trust, and there are some
      others for you to, RELY.
</li>
<li><code>[&nbsp;]</code> Photography. You should find some things to do, so that you
      can be AFK for those games. For computing, programming and
      geeking, I am the one. NEVER NEVER NEVER fuckingly give up. If
      you give up, you will lose both boobs and noobs.
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 20140918</h3>
<div class="outline-text-3" id="text-1-7">



</div>

<div id="outline-container-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> Lab, 15:50 <span class="timestamp-wrapper"> <span class="timestamp">2014-09-18 Thu</span></span></h4>
<div class="outline-text-4" id="text-1-7-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2014-09-18 Thu 23:30</span></span><br/>
</p><ul>
<li>Go and get books from library
</li>
<li>Attend the class which should done a long time go.
</li>
<li>Finish the git, python and Scheme (used for computer science)
      tutorials then start reading, writing, and programming.<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> CR9, 17:00</h4>
<div class="outline-text-4" id="text-1-7-2">

<ul>
<li><b>Keynote for weekend</b> Git tutorials, Python and Scheme.
</li>
<li>If possible, read the book "Embedded Systems" to be more aware
      of what you might <b>might have to do</b> in the future.
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> mpais@masdar.ac.ae
</p>








</div>
</div>
</div>
</div>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-18T17:04+0400</p>
<p class="author">Author: Abraham Xiao</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
